// Частина №1
// Створити скрипт яки повинен виконувати наступне:
// запитати у користувача рік народження;
// запитати в нього, в якому місті він живе;
// запитати його улюблений вид спорту.
// При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
// його вік;
// якщо користувач вкаже Київ, Вашингтон чи Лондон, то
// показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну,
// столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.
// Частина №2
// Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно,
// якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення
// “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.
// Все це має бути відображено в одному вікні (аллерті).
// Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати,
// показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …”
// і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .
var age;
var capital;
var champions;
do {
    age = Number(prompt("Введіть рік народження: (only numbers):"));
    if (isNaN(age)) {
        alert("\u0432\u0438 \u0432\u043A\u0430\u0437\u0430\u043B\u0438 \u043B\u0456\u0442\u0435\u0440\u0438 \u0430\u0431\u043E \u043F\u0440\u043E\u0431\u0456\u043B\u0438, \u0430 \u043C\u043E\u0436\u043D\u0430 \u0442\u0456\u043B\u044C\u043A\u0438 \u0446\u0438\u0444\u0440\u0438");
    }
} while (isNaN(age));
if (!age) {
    alert('шкода що ви не вказали свій вік');
}
var city = prompt("В якому місті ви живете? (only Eng): ");
if (!city || city.trim() === "") {
    alert("шкода що ви не вказали своє місто");
}
switch (city) {
    case "Kyiv":
        capital = "Ти живеш у країні : Ukraine";
        break;
    case "Washington":
        capital = "Ти живеш у країні : USA";
        break;
    case "London":
        capital = "Ти живеш у країні : UK";
        break;
    case "Berlin":
        capital = "Ти живеш у країні : Germany";
        break;
    default:
        capital = "\u0422\u0438 \u0436\u0438\u0432\u0435\u0448 \u0443 \u043C\u0456\u0441\u0442\u0456 : ".concat(city);
}
var sport = prompt("Який ваш улюблений вид спорту? (only Eng):");
if (!sport || sport.trim() === "") {
    alert("шкода що ви не вказали свій улюблений вид спорту");
}
switch (sport) {
    case "football":
        champions = "Круто! хочеш стати як, Мессі";
        break;
    case "basketball":
        champions = "Круто! хочеш стати як, Майкл Джордан";
        break;
    case "box":
    case "boxing":
        champions = "Круто! хочеш стати як, Майк Тайсон";
        break;
    default:
        champions = "\u0422\u0432\u0456\u0439 \u0443\u043B\u044E\u0431\u043B\u0435\u043D\u0438\u0439 \u0432\u0438\u0434 \u0441\u043F\u043E\u0440\u0442\u0443 : ".concat(sport);
}
alert("".concat(age ? "\u0422\u0432\u0456\u0439 \u0432\u0456\u043A : ".concat(age) : 'ви не вказали свій вік!', " \n  \n").concat(city ? "".concat(capital) : 'ви не вказали своє місто!', "\n  \n").concat(sport ? "".concat(champions) : 'ви не казали свій улюблений вид спорту!'));
